; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-8-6)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 - room
ball1 ball2 ball3 ball4 ball5 ball6 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room7)
(at ball2 room2)
(at ball3 room8)
(at ball4 room5)
(at ball5 room2)
(at ball6 room4)
)
(:goal
(and
(at ball1 room8)
(at ball2 room7)
(at ball3 room5)
(at ball4 room3)
(at ball5 room1)
(at ball6 room7)
)
)
)

; plan
1. (move robot1 room1 room8)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room8)
   goals met: 0 of 6
2. (pick robot1 ball3 room8 lgripper1)
   deleted: (at ball3 room8) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 0 of 6
3. (move robot1 room8 room5)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room5)
   goals met: 0 of 6
4. (drop robot1 ball3 room5 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room5) (free robot1 lgripper1)
   goals met: 1 of 6
5. (pick robot1 ball4 room5 rgripper1)
   deleted: (at ball4 room5) (free robot1 rgripper1)
   added: (carry robot1 ball4 rgripper1)
   goals met: 1 of 6
6. (move robot1 room5 room8)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room8)
   goals met: 1 of 6
7. (move robot1 room8 room3)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room3)
   goals met: 1 of 6
8. (drop robot1 ball4 room3 rgripper1)
   deleted: (carry robot1 ball4 rgripper1)
   added: (at ball4 room3) (free robot1 rgripper1)
   goals met: 2 of 6
9. (move robot1 room3 room8)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room8)
   goals met: 2 of 6
10. (move robot1 room8 room7)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room7)
   goals met: 2 of 6
11. (pick robot1 ball1 room7 lgripper1)
   deleted: (at ball1 room7) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 2 of 6
12. (move robot1 room7 room8)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room8)
   goals met: 2 of 6
13. (drop robot1 ball1 room8 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room8) (free robot1 lgripper1)
   goals met: 3 of 6
14. (move robot1 room8 room7)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room7)
   goals met: 3 of 6
15. (move robot1 room7 room4)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room4)
   goals met: 3 of 6
16. (pick robot1 ball6 room4 lgripper1)
   deleted: (at ball6 room4) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 3 of 6
17. (move robot1 room4 room7)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room7)
   goals met: 3 of 6
18. (drop robot1 ball6 room7 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room7) (free robot1 lgripper1)
   goals met: 4 of 6
19. (move robot1 room7 room2)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room2)
   goals met: 4 of 6
20. (pick robot1 ball5 room2 lgripper1)
   deleted: (at ball5 room2) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 4 of 6
21. (pick robot1 ball2 room2 rgripper1)
   deleted: (at ball2 room2) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 4 of 6
22. (move robot1 room2 room7)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room7)
   goals met: 4 of 6
23. (drop robot1 ball2 room7 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room7) (free robot1 rgripper1)
   goals met: 5 of 6
24. (move robot1 room7 room1)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room1)
   goals met: 5 of 6
25. (drop robot1 ball5 room1 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room1) (free robot1 lgripper1)
   goals met: 6 of 6
